<?

Class Translit {

    function __construct($proxy = NULL) {
        
    }

    public function get($str){
        $insert = mb_strtolower($str,"UTF-8"); // Все почему-то упорно переводят и заглавные и прописные, а потом делают strtolower Я сделал сразу, тем самым уменьшив массив
        $replase = array(
        // Буквы
        'а'=>'a',
        'б'=>'b',
        'в'=>'v',
        'г'=>'g',
        'д'=>'d',
        'е'=>'e',
        'ё'=>'e',
        'ж'=>'zh',
        'з'=>'z',
        'и'=>'i',
        'й'=>'i',
        'к'=>'k',
        'л'=>'l',
        'м'=>'m',
        'н'=>'n',
        'о'=>'o',
        'п'=>'p',
        'р'=>'r',
        'с'=>'s',
        'т'=>'t',
        'у'=>'u',
        'ф'=>'f',
        'х'=>'kh',
        'ц'=>'ts',
        'ч'=>'ch',
        'ш'=>'sh',
        'щ'=>'shh',
        'ъ'=>'j',
        'ы'=>'y',
        'ь'=>'',
        'э'=>'e',
        'ю'=>'yu',
        'я'=>'ya',
        // Всякие знаки препинания и пробелы
        ' '=>'-',
        ' - '=>'-',
        '_'=>'-',
        '/'=>'-',
        '*'=>'-',
        '+'=>'-',
        //Удаляем
        // '.'=>'',
        ':'=>'',
        ';'=>'',
        ','=>'',
        '!'=>'',
        '?'=>'',
        '>'=>'',
        '<'=>'',
        '&'=>'',
        '%'=>'',
        '$'=>'',
        '"'=>'',
        '\''=>'',
        '('=>'',
        ')'=>'',
        '`'=>'',
        '\\'=>'',
        );
        $insert = preg_replace("/ +/"," ",$insert); // Удаляем лишние пробелы
        $insert = strtr($insert,$replase);
        $insert = str_replace(" ", "", $insert); // Удаляем неразрывные пробелы
        return $insert;
    }
}

?>